In [2]:
import pandas as pd
dados = pd.read_excel('AnyConv.com__didaticatech.xlsx')

In [3]:
dados.head(6)

   Números Letras
0        1      a
1        2      b
2        3      c
3        4      d
4        5      e
5        6      f

In [6]:
alunosDIC = {'Nome':['Ricardo','Pedro','Carlos','Roberto'],
             'Nota':[4,5,9,7],
             'Aprovado':['Não','Não','Sim','Sim']}

In [7]:
alunosDF = pd.DataFrame(alunosDIC)

In [8]:
print(alunosDF)

      Nome  Nota Aprovado
0  Ricardo     4      Não
1    Pedro     5      Não
2   Carlos     9      Sim
3  Roberto     7      Sim

In [9]:
alunosDF.head()

      Nome  Nota Aprovado
0  Ricardo     4      Não
1    Pedro     5      Não
2   Carlos     9      Sim
3  Roberto     7      Sim

In [10]:
alunosDF.shape

(4, 3)

In [12]:
alunosDF.describe()

           Nota
count  4.000000
mean   6.250000
std    2.217356
min    4.000000
25%    4.750000
50%    6.000000
75%    7.500000
max    9.000000

In [14]:
alunosDF['Nome']

0    Ricardo
1      Pedro
2     Carlos
3    Roberto
Name: Nome, dtype: object

In [19]:
alunosDF.loc[[3,2]]

      Nome  Nota Aprovado
3  Roberto     7      Sim
2   Carlos     9      Sim

In [24]:
alunosDF.loc[alunosDF['Aprovado']=='Sim']

      Nome  Nota Aprovado
2   Carlos     9      Sim
3  Roberto     7      Sim

In [25]:
alunosDF.head()

      Nome  Nota Aprovado
0  Ricardo     4      Não
1    Pedro     5      Não
2   Carlos     9      Sim
3  Roberto     7      Sim

In [27]:
alunosDS=alunosDF.loc[0:2]

In [28]:
alunosDS.head()

      Nome  Nota Aprovado
0  Ricardo     4      Não
1    Pedro     5      Não
2   Carlos     9      Sim

In [30]:
novoDF = alunosDF.loc[alunosDF['Nota']!=9]
novoDF.head()

      Nome  Nota Aprovado
0  Ricardo     4      Não
1    Pedro     5      Não
3  Roberto     7      Sim